---
kind: type
id: T:Autodesk.Revit.DB.Electrical.WireSizeSet
source: html/55f9a130-e931-ebc0-0935-9b6c24674c8e.htm
---
# Autodesk.Revit.DB.Electrical.WireSizeSet

A set that contains wire sizes.

## Syntax (C#)
```csharp
public class WireSizeSet : APIObject,
	IEnumerable
```